Repository: magiclobster/cmm
Catalog: cmm/translations/*/LC_MESSAGES/messages.po
Languages: de

source: Welcome to the matchmaking software of the Chaosmentors
de: Willkommen bei der Matchmaking Software des Chaosmentors Projekts

source: Register
de: Registrieren

source: Please Register as a Mentee
de: Als Chaospatenkind registrieren

source: Nickname
de: Benutzername

source: Mail
de: E-Mail

source: Description
de: Beschreibung

source: Please select your Interests
de: Bitte wähle deine Interessen

source: Thank you for your Registration
de: Danke für deine Registrierung

source: We recorded the following information
de: Wir haben die folgenden Informationen gespeichert

source: Link to your Account
de: Link zu deinem Benutzerkonto

source: Your E-Mail
de: Deine E-Mail

source: Your Selection
de: Deine Auswahl

source: Shortly you will receive a E-Mail containing further Information and Instructions about how to proceed
de: In Kürze erhälst du eine E-Mail mit weiteren Informationen, wie es weitergeht
